Lines cannot intersect each other. The highlighted lines currently intersect.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId LoopIntersectError { get; }
  Visual Basic
Public Shared ReadOnly Property LoopIntersectError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ LoopIntersectError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace